app/controllers/puppies_controller.rb

SELECT "puppies".* FROM "puppies"
---
  def index
    @puppies = Puppy.all

SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT 1  [["id", 1]]
---
  def upvote
  @puppy = Puppy.find(params[:id])

INSERT INTO "puppies" ("name", "breed", "owner", "votes", "image", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @puppy = Puppy.new(puppy_params)

    respond_to do |format|
      if @puppy.save

SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_puppy
      @puppy = Puppy.find(params[:id])